node {
  name: "fingerprint_input"
  op: "Placeholder"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 192
        }
      }
    }
  }
}
node {
  name: "dropout_prob"
  op: "Placeholder"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "Reshape/shape"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\377\377\377\377 \000\000\000\006\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "Reshape"
  op: "Reshape"
  input: "fingerprint_input"
  input: "Reshape/shape"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "DS-CNN/conv_1/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\006\000\000\000\006\000\000\000\001\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "DS-CNN/conv_1/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.0710669085383
      }
    }
  }
}
node {
  name: "DS-CNN/conv_1/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0710669085383
      }
    }
  }
}
node {
  name: "DS-CNN/conv_1/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "DS-CNN/conv_1/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "DS-CNN/conv_1/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "DS-CNN/conv_1/weights/Initializer/random_uniform/max"
  input: "DS-CNN/conv_1/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_1/weights"
      }
    }
  }
}
node {
  name: "DS-CNN/conv_1/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "DS-CNN/conv_1/weights/Initializer/random_uniform/RandomUniform"
  input: "DS-CNN/conv_1/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_1/weights"
      }
    }
  }
}
node {
  name: "DS-CNN/conv_1/weights/Initializer/random_uniform"
  op: "Add"
  input: "DS-CNN/conv_1/weights/Initializer/random_uniform/mul"
  input: "DS-CNN/conv_1/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_1/weights"
      }
    }
  }
}
node {
  name: "DS-CNN/conv_1/weights"
  op: "VariableV2"
  device: "/device:GPU:1"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_1/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 6
        }
        dim {
          size: 6
        }
        dim {
          size: 1
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "DS-CNN/conv_1/weights/Assign"
  op: "Assign"
  input: "DS-CNN/conv_1/weights"
  input: "DS-CNN/conv_1/weights/Initializer/random_uniform"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_1/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "DS-CNN/conv_1/weights/read"
  op: "Identity"
  input: "DS-CNN/conv_1/weights"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_1/weights"
      }
    }
  }
}
node {
  name: "DS-CNN/conv_1/biases/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_1/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "DS-CNN/conv_1/biases"
  op: "VariableV2"
  device: "/device:GPU:1"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_1/biases"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "DS-CNN/conv_1/biases/Assign"
  op: "Assign"
  input: "DS-CNN/conv_1/biases"
  input: "DS-CNN/conv_1/biases/Initializer/zeros"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_1/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "DS-CNN/conv_1/biases/read"
  op: "Identity"
  input: "DS-CNN/conv_1/biases"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_1/biases"
      }
    }
  }
}
node {
  name: "DS-CNN/conv_1/dilation_rate"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "DS-CNN/conv_1/Conv2D"
  op: "Conv2D"
  input: "Reshape"
  input: "DS-CNN/conv_1/weights/read"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "DS-CNN/conv_1/BiasAdd"
  op: "BiasAdd"
  input: "DS-CNN/conv_1/Conv2D"
  input: "DS-CNN/conv_1/biases/read"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "DS-CNN/conv_1/batch_norm/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_1/batch_norm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "DS-CNN/conv_1/batch_norm/beta"
  op: "VariableV2"
  device: "/device:GPU:1"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_1/batch_norm/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "DS-CNN/conv_1/batch_norm/beta/Assign"
  op: "Assign"
  input: "DS-CNN/conv_1/batch_norm/beta"
  input: "DS-CNN/conv_1/batch_norm/beta/Initializer/zeros"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_1/batch_norm/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "DS-CNN/conv_1/batch_norm/beta/read"
  op: "Identity"
  input: "DS-CNN/conv_1/batch_norm/beta"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_1/batch_norm/beta"
      }
    }
  }
}
node {
  name: "DS-CNN/conv_1/batch_norm/Const"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "DS-CNN/conv_1/batch_norm/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_1/batch_norm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "DS-CNN/conv_1/batch_norm/moving_mean"
  op: "VariableV2"
  device: "/device:GPU:1"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_1/batch_norm/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "DS-CNN/conv_1/batch_norm/moving_mean/Assign"
  op: "Assign"
  input: "DS-CNN/conv_1/batch_norm/moving_mean"
  input: "DS-CNN/conv_1/batch_norm/moving_mean/Initializer/zeros"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_1/batch_norm/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "DS-CNN/conv_1/batch_norm/moving_mean/read"
  op: "Identity"
  input: "DS-CNN/conv_1/batch_norm/moving_mean"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_1/batch_norm/moving_mean"
      }
    }
  }
}
node {
  name: "DS-CNN/conv_1/batch_norm/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_1/batch_norm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "DS-CNN/conv_1/batch_norm/moving_variance"
  op: "VariableV2"
  device: "/device:GPU:1"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_1/batch_norm/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "DS-CNN/conv_1/batch_norm/moving_variance/Assign"
  op: "Assign"
  input: "DS-CNN/conv_1/batch_norm/moving_variance"
  input: "DS-CNN/conv_1/batch_norm/moving_variance/Initializer/ones"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_1/batch_norm/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "DS-CNN/conv_1/batch_norm/moving_variance/read"
  op: "Identity"
  input: "DS-CNN/conv_1/batch_norm/moving_variance"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_1/batch_norm/moving_variance"
      }
    }
  }
}
node {
  name: "DS-CNN/conv_1/batch_norm/Const_1"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "DS-CNN/conv_1/batch_norm/Const_2"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "DS-CNN/conv_1/batch_norm/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "DS-CNN/conv_1/BiasAdd"
  input: "DS-CNN/conv_1/batch_norm/Const"
  input: "DS-CNN/conv_1/batch_norm/beta/read"
  input: "DS-CNN/conv_1/batch_norm/Const_1"
  input: "DS-CNN/conv_1/batch_norm/Const_2"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
  attr {
    key: "is_training"
    value {
      b: true
    }
  }
}
node {
  name: "DS-CNN/conv_1/batch_norm/AssignMovingAvg/decay"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_1/batch_norm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0399999991059
      }
    }
  }
}
node {
  name: "DS-CNN/conv_1/batch_norm/AssignMovingAvg/sub"
  op: "Sub"
  input: "DS-CNN/conv_1/batch_norm/moving_mean/read"
  input: "DS-CNN/conv_1/batch_norm/FusedBatchNorm:1"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_1/batch_norm/moving_mean"
      }
    }
  }
}
node {
  name: "DS-CNN/conv_1/batch_norm/AssignMovingAvg/mul"
  op: "Mul"
  input: "DS-CNN/conv_1/batch_norm/AssignMovingAvg/sub"
  input: "DS-CNN/conv_1/batch_norm/AssignMovingAvg/decay"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_1/batch_norm/moving_mean"
      }
    }
  }
}
node {
  name: "DS-CNN/conv_1/batch_norm/AssignMovingAvg"
  op: "AssignSub"
  input: "DS-CNN/conv_1/batch_norm/moving_mean"
  input: "DS-CNN/conv_1/batch_norm/AssignMovingAvg/mul"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_1/batch_norm/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "DS-CNN/conv_1/batch_norm/AssignMovingAvg_1/decay"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_1/batch_norm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0399999991059
      }
    }
  }
}
node {
  name: "DS-CNN/conv_1/batch_norm/AssignMovingAvg_1/sub"
  op: "Sub"
  input: "DS-CNN/conv_1/batch_norm/moving_variance/read"
  input: "DS-CNN/conv_1/batch_norm/FusedBatchNorm:2"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_1/batch_norm/moving_variance"
      }
    }
  }
}
node {
  name: "DS-CNN/conv_1/batch_norm/AssignMovingAvg_1/mul"
  op: "Mul"
  input: "DS-CNN/conv_1/batch_norm/AssignMovingAvg_1/sub"
  input: "DS-CNN/conv_1/batch_norm/AssignMovingAvg_1/decay"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_1/batch_norm/moving_variance"
      }
    }
  }
}
node {
  name: "DS-CNN/conv_1/batch_norm/AssignMovingAvg_1"
  op: "AssignSub"
  input: "DS-CNN/conv_1/batch_norm/moving_variance"
  input: "DS-CNN/conv_1/batch_norm/AssignMovingAvg_1/mul"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_1/batch_norm/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "DS-CNN/conv_1/batch_norm/Identity"
  op: "Identity"
  input: "DS-CNN/conv_1/batch_norm/FusedBatchNorm"
  input: "^DS-CNN/conv_1/batch_norm/AssignMovingAvg"
  input: "^DS-CNN/conv_1/batch_norm/AssignMovingAvg_1"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "DS-CNN/conv_1/batch_norm/Relu"
  op: "Relu"
  input: "DS-CNN/conv_1/batch_norm/Identity"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/depthwise_weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/dw_conv/depthwise_weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\006\000\000\000\006\000\000\000 \000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/depthwise_weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/dw_conv/depthwise_weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.0710669085383
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/depthwise_weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/dw_conv/depthwise_weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0710669085383
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/depthwise_weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "DS-CNN/conv_ds_1/dw_conv/depthwise_weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/dw_conv/depthwise_weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/depthwise_weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "DS-CNN/conv_ds_1/dw_conv/depthwise_weights/Initializer/random_uniform/max"
  input: "DS-CNN/conv_ds_1/dw_conv/depthwise_weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/dw_conv/depthwise_weights"
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/depthwise_weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "DS-CNN/conv_ds_1/dw_conv/depthwise_weights/Initializer/random_uniform/RandomUniform"
  input: "DS-CNN/conv_ds_1/dw_conv/depthwise_weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/dw_conv/depthwise_weights"
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/depthwise_weights/Initializer/random_uniform"
  op: "Add"
  input: "DS-CNN/conv_ds_1/dw_conv/depthwise_weights/Initializer/random_uniform/mul"
  input: "DS-CNN/conv_ds_1/dw_conv/depthwise_weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/dw_conv/depthwise_weights"
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/depthwise_weights"
  op: "VariableV2"
  device: "/device:GPU:1"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/dw_conv/depthwise_weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 6
        }
        dim {
          size: 6
        }
        dim {
          size: 32
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/depthwise_weights/Assign"
  op: "Assign"
  input: "DS-CNN/conv_ds_1/dw_conv/depthwise_weights"
  input: "DS-CNN/conv_ds_1/dw_conv/depthwise_weights/Initializer/random_uniform"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/dw_conv/depthwise_weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/depthwise_weights/read"
  op: "Identity"
  input: "DS-CNN/conv_ds_1/dw_conv/depthwise_weights"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/dw_conv/depthwise_weights"
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/depthwise/Shape"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\006\000\000\000\006\000\000\000 \000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/depthwise/dilation_rate"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/depthwise"
  op: "DepthwiseConv2dNative"
  input: "DS-CNN/conv_1/batch_norm/Relu"
  input: "DS-CNN/conv_ds_1/dw_conv/depthwise_weights/read"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/biases/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/dw_conv/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/biases"
  op: "VariableV2"
  device: "/device:GPU:1"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/dw_conv/biases"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/biases/Assign"
  op: "Assign"
  input: "DS-CNN/conv_ds_1/dw_conv/biases"
  input: "DS-CNN/conv_ds_1/dw_conv/biases/Initializer/zeros"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/dw_conv/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/biases/read"
  op: "Identity"
  input: "DS-CNN/conv_ds_1/dw_conv/biases"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/dw_conv/biases"
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/BiasAdd"
  op: "BiasAdd"
  input: "DS-CNN/conv_ds_1/dw_conv/depthwise"
  input: "DS-CNN/conv_ds_1/dw_conv/biases/read"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/batch_norm/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/dw_conv/batch_norm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/batch_norm/beta"
  op: "VariableV2"
  device: "/device:GPU:1"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/dw_conv/batch_norm/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/batch_norm/beta/Assign"
  op: "Assign"
  input: "DS-CNN/conv_ds_1/dw_conv/batch_norm/beta"
  input: "DS-CNN/conv_ds_1/dw_conv/batch_norm/beta/Initializer/zeros"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/dw_conv/batch_norm/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/batch_norm/beta/read"
  op: "Identity"
  input: "DS-CNN/conv_ds_1/dw_conv/batch_norm/beta"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/dw_conv/batch_norm/beta"
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/batch_norm/Const"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/batch_norm/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/dw_conv/batch_norm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/batch_norm/moving_mean"
  op: "VariableV2"
  device: "/device:GPU:1"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/dw_conv/batch_norm/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/batch_norm/moving_mean/Assign"
  op: "Assign"
  input: "DS-CNN/conv_ds_1/dw_conv/batch_norm/moving_mean"
  input: "DS-CNN/conv_ds_1/dw_conv/batch_norm/moving_mean/Initializer/zeros"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/dw_conv/batch_norm/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/batch_norm/moving_mean/read"
  op: "Identity"
  input: "DS-CNN/conv_ds_1/dw_conv/batch_norm/moving_mean"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/dw_conv/batch_norm/moving_mean"
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/batch_norm/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/dw_conv/batch_norm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/batch_norm/moving_variance"
  op: "VariableV2"
  device: "/device:GPU:1"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/dw_conv/batch_norm/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/batch_norm/moving_variance/Assign"
  op: "Assign"
  input: "DS-CNN/conv_ds_1/dw_conv/batch_norm/moving_variance"
  input: "DS-CNN/conv_ds_1/dw_conv/batch_norm/moving_variance/Initializer/ones"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/dw_conv/batch_norm/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/batch_norm/moving_variance/read"
  op: "Identity"
  input: "DS-CNN/conv_ds_1/dw_conv/batch_norm/moving_variance"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/dw_conv/batch_norm/moving_variance"
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/batch_norm/Const_1"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/batch_norm/Const_2"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/batch_norm/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "DS-CNN/conv_ds_1/dw_conv/BiasAdd"
  input: "DS-CNN/conv_ds_1/dw_conv/batch_norm/Const"
  input: "DS-CNN/conv_ds_1/dw_conv/batch_norm/beta/read"
  input: "DS-CNN/conv_ds_1/dw_conv/batch_norm/Const_1"
  input: "DS-CNN/conv_ds_1/dw_conv/batch_norm/Const_2"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
  attr {
    key: "is_training"
    value {
      b: true
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/batch_norm/AssignMovingAvg/decay"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/dw_conv/batch_norm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0399999991059
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/batch_norm/AssignMovingAvg/sub"
  op: "Sub"
  input: "DS-CNN/conv_ds_1/dw_conv/batch_norm/moving_mean/read"
  input: "DS-CNN/conv_ds_1/dw_conv/batch_norm/FusedBatchNorm:1"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/dw_conv/batch_norm/moving_mean"
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/batch_norm/AssignMovingAvg/mul"
  op: "Mul"
  input: "DS-CNN/conv_ds_1/dw_conv/batch_norm/AssignMovingAvg/sub"
  input: "DS-CNN/conv_ds_1/dw_conv/batch_norm/AssignMovingAvg/decay"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/dw_conv/batch_norm/moving_mean"
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/batch_norm/AssignMovingAvg"
  op: "AssignSub"
  input: "DS-CNN/conv_ds_1/dw_conv/batch_norm/moving_mean"
  input: "DS-CNN/conv_ds_1/dw_conv/batch_norm/AssignMovingAvg/mul"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/dw_conv/batch_norm/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/batch_norm/AssignMovingAvg_1/decay"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/dw_conv/batch_norm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0399999991059
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/batch_norm/AssignMovingAvg_1/sub"
  op: "Sub"
  input: "DS-CNN/conv_ds_1/dw_conv/batch_norm/moving_variance/read"
  input: "DS-CNN/conv_ds_1/dw_conv/batch_norm/FusedBatchNorm:2"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/dw_conv/batch_norm/moving_variance"
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/batch_norm/AssignMovingAvg_1/mul"
  op: "Mul"
  input: "DS-CNN/conv_ds_1/dw_conv/batch_norm/AssignMovingAvg_1/sub"
  input: "DS-CNN/conv_ds_1/dw_conv/batch_norm/AssignMovingAvg_1/decay"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/dw_conv/batch_norm/moving_variance"
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/batch_norm/AssignMovingAvg_1"
  op: "AssignSub"
  input: "DS-CNN/conv_ds_1/dw_conv/batch_norm/moving_variance"
  input: "DS-CNN/conv_ds_1/dw_conv/batch_norm/AssignMovingAvg_1/mul"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/dw_conv/batch_norm/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/batch_norm/Identity"
  op: "Identity"
  input: "DS-CNN/conv_ds_1/dw_conv/batch_norm/FusedBatchNorm"
  input: "^DS-CNN/conv_ds_1/dw_conv/batch_norm/AssignMovingAvg"
  input: "^DS-CNN/conv_ds_1/dw_conv/batch_norm/AssignMovingAvg_1"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/dw_conv/batch_norm/Relu"
  op: "Relu"
  input: "DS-CNN/conv_ds_1/dw_conv/batch_norm/Identity"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/pw_conv/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/pw_conv/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000 \000\000\000\020\000\000\000"
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/pw_conv/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/pw_conv/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.353553384542
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/pw_conv/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/pw_conv/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.353553384542
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/pw_conv/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "DS-CNN/conv_ds_1/pw_conv/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/pw_conv/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/pw_conv/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "DS-CNN/conv_ds_1/pw_conv/weights/Initializer/random_uniform/max"
  input: "DS-CNN/conv_ds_1/pw_conv/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/pw_conv/weights"
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/pw_conv/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "DS-CNN/conv_ds_1/pw_conv/weights/Initializer/random_uniform/RandomUniform"
  input: "DS-CNN/conv_ds_1/pw_conv/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/pw_conv/weights"
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/pw_conv/weights/Initializer/random_uniform"
  op: "Add"
  input: "DS-CNN/conv_ds_1/pw_conv/weights/Initializer/random_uniform/mul"
  input: "DS-CNN/conv_ds_1/pw_conv/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/pw_conv/weights"
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/pw_conv/weights"
  op: "VariableV2"
  device: "/device:GPU:1"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/pw_conv/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 32
        }
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/pw_conv/weights/Assign"
  op: "Assign"
  input: "DS-CNN/conv_ds_1/pw_conv/weights"
  input: "DS-CNN/conv_ds_1/pw_conv/weights/Initializer/random_uniform"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/pw_conv/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/pw_conv/weights/read"
  op: "Identity"
  input: "DS-CNN/conv_ds_1/pw_conv/weights"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/pw_conv/weights"
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/pw_conv/biases/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/pw_conv/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/pw_conv/biases"
  op: "VariableV2"
  device: "/device:GPU:1"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/pw_conv/biases"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/pw_conv/biases/Assign"
  op: "Assign"
  input: "DS-CNN/conv_ds_1/pw_conv/biases"
  input: "DS-CNN/conv_ds_1/pw_conv/biases/Initializer/zeros"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/pw_conv/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/pw_conv/biases/read"
  op: "Identity"
  input: "DS-CNN/conv_ds_1/pw_conv/biases"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/pw_conv/biases"
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/pw_conv/dilation_rate"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/pw_conv/Conv2D"
  op: "Conv2D"
  input: "DS-CNN/conv_ds_1/dw_conv/batch_norm/Relu"
  input: "DS-CNN/conv_ds_1/pw_conv/weights/read"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/pw_conv/BiasAdd"
  op: "BiasAdd"
  input: "DS-CNN/conv_ds_1/pw_conv/Conv2D"
  input: "DS-CNN/conv_ds_1/pw_conv/biases/read"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/pw_conv/batch_norm/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/pw_conv/batch_norm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "DS-CNN/conv_ds_1/pw_conv/batch_norm/beta"
  op: "VariableV2"
  device: "/device:GPU:1"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DS-CNN/conv_ds_1/pw_conv/batch_norm/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
