node {
  name: "fingerprint_input"
  op: "Placeholder"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 192
        }
      }
    }
  }
}
node {
  name: "dropout_prob"
  op: "Placeholder"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "Reshape/shape"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\377\377\377\377\006\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "Reshape"
  op: "Reshape"
  input: "fingerprint_input"
  input: "Reshape/shape"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/Rank"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/range/start"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/range/delta"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/range"
  op: "Range"
  input: "LSTM-Layer/lstm/rnn/range/start"
  input: "LSTM-Layer/lstm/rnn/Rank"
  input: "LSTM-Layer/lstm/rnn/range/delta"
  device: "/device:GPU:1"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/concat/values_0"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/concat/axis"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/concat"
  op: "ConcatV2"
  input: "LSTM-Layer/lstm/rnn/concat/values_0"
  input: "LSTM-Layer/lstm/rnn/range"
  input: "LSTM-Layer/lstm/rnn/concat/axis"
  device: "/device:GPU:1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/transpose"
  op: "Transpose"
  input: "Reshape"
  input: "LSTM-Layer/lstm/rnn/concat"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/Shape"
  op: "Shape"
  input: "LSTM-Layer/lstm/rnn/transpose"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/strided_slice/stack"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/strided_slice/stack_1"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/strided_slice/stack_2"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/strided_slice"
  op: "StridedSlice"
  input: "LSTM-Layer/lstm/rnn/Shape"
  input: "LSTM-Layer/lstm/rnn/strided_slice/stack"
  input: "LSTM-Layer/lstm/rnn/strided_slice/stack_1"
  input: "LSTM-Layer/lstm/rnn/strided_slice/stack_2"
  device: "/device:GPU:1"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/LSTMCellZeroState/ExpandDims/dim"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/LSTMCellZeroState/ExpandDims"
  op: "ExpandDims"
  input: "LSTM-Layer/lstm/rnn/strided_slice"
  input: "LSTM-Layer/lstm/rnn/LSTMCellZeroState/ExpandDims/dim"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/LSTMCellZeroState/Const"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 4
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/LSTMCellZeroState/concat/axis"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/LSTMCellZeroState/concat"
  op: "ConcatV2"
  input: "LSTM-Layer/lstm/rnn/LSTMCellZeroState/ExpandDims"
  input: "LSTM-Layer/lstm/rnn/LSTMCellZeroState/Const"
  input: "LSTM-Layer/lstm/rnn/LSTMCellZeroState/concat/axis"
  device: "/device:GPU:1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/LSTMCellZeroState/zeros/Const"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/LSTMCellZeroState/zeros"
  op: "Fill"
  input: "LSTM-Layer/lstm/rnn/LSTMCellZeroState/concat"
  input: "LSTM-Layer/lstm/rnn/LSTMCellZeroState/zeros/Const"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/LSTMCellZeroState/ExpandDims_1/dim"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/LSTMCellZeroState/ExpandDims_1"
  op: "ExpandDims"
  input: "LSTM-Layer/lstm/rnn/strided_slice"
  input: "LSTM-Layer/lstm/rnn/LSTMCellZeroState/ExpandDims_1/dim"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/LSTMCellZeroState/Const_1"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 4
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/LSTMCellZeroState/ExpandDims_2/dim"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/LSTMCellZeroState/ExpandDims_2"
  op: "ExpandDims"
  input: "LSTM-Layer/lstm/rnn/strided_slice"
  input: "LSTM-Layer/lstm/rnn/LSTMCellZeroState/ExpandDims_2/dim"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/LSTMCellZeroState/Const_2"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 4
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/LSTMCellZeroState/concat_1/axis"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/LSTMCellZeroState/concat_1"
  op: "ConcatV2"
  input: "LSTM-Layer/lstm/rnn/LSTMCellZeroState/ExpandDims_2"
  input: "LSTM-Layer/lstm/rnn/LSTMCellZeroState/Const_2"
  input: "LSTM-Layer/lstm/rnn/LSTMCellZeroState/concat_1/axis"
  device: "/device:GPU:1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/LSTMCellZeroState/zeros_1/Const"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/LSTMCellZeroState/zeros_1"
  op: "Fill"
  input: "LSTM-Layer/lstm/rnn/LSTMCellZeroState/concat_1"
  input: "LSTM-Layer/lstm/rnn/LSTMCellZeroState/zeros_1/Const"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/LSTMCellZeroState/ExpandDims_3/dim"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/LSTMCellZeroState/ExpandDims_3"
  op: "ExpandDims"
  input: "LSTM-Layer/lstm/rnn/strided_slice"
  input: "LSTM-Layer/lstm/rnn/LSTMCellZeroState/ExpandDims_3/dim"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/LSTMCellZeroState/Const_3"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 4
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/Shape_1"
  op: "Shape"
  input: "LSTM-Layer/lstm/rnn/transpose"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/strided_slice_1/stack"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/strided_slice_1/stack_1"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/strided_slice_1/stack_2"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/strided_slice_1"
  op: "StridedSlice"
  input: "LSTM-Layer/lstm/rnn/Shape_1"
  input: "LSTM-Layer/lstm/rnn/strided_slice_1/stack"
  input: "LSTM-Layer/lstm/rnn/strided_slice_1/stack_1"
  input: "LSTM-Layer/lstm/rnn/strided_slice_1/stack_2"
  device: "/device:GPU:1"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/Shape_2"
  op: "Shape"
  input: "LSTM-Layer/lstm/rnn/transpose"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/strided_slice_2/stack"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/strided_slice_2/stack_1"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/strided_slice_2/stack_2"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/strided_slice_2"
  op: "StridedSlice"
  input: "LSTM-Layer/lstm/rnn/Shape_2"
  input: "LSTM-Layer/lstm/rnn/strided_slice_2/stack"
  input: "LSTM-Layer/lstm/rnn/strided_slice_2/stack_1"
  input: "LSTM-Layer/lstm/rnn/strided_slice_2/stack_2"
  device: "/device:GPU:1"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/ExpandDims/dim"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/ExpandDims"
  op: "ExpandDims"
  input: "LSTM-Layer/lstm/rnn/strided_slice_2"
  input: "LSTM-Layer/lstm/rnn/ExpandDims/dim"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/Const"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 4
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/concat_1/axis"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/concat_1"
  op: "ConcatV2"
  input: "LSTM-Layer/lstm/rnn/ExpandDims"
  input: "LSTM-Layer/lstm/rnn/Const"
  input: "LSTM-Layer/lstm/rnn/concat_1/axis"
  device: "/device:GPU:1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/zeros/Const"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/zeros"
  op: "Fill"
  input: "LSTM-Layer/lstm/rnn/concat_1"
  input: "LSTM-Layer/lstm/rnn/zeros/Const"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/time"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/TensorArray"
  op: "TensorArrayV3"
  input: "LSTM-Layer/lstm/rnn/strided_slice_1"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 4
        }
      }
    }
  }
  attr {
    key: "identical_element_shapes"
    value {
      b: true
    }
  }
  attr {
    key: "tensor_array_name"
    value {
      s: "LSTM-Layer/lstm/rnn/dynamic_rnn/output_0"
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/TensorArray_1"
  op: "TensorArrayV3"
  input: "LSTM-Layer/lstm/rnn/strided_slice_1"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "identical_element_shapes"
    value {
      b: true
    }
  }
  attr {
    key: "tensor_array_name"
    value {
      s: "LSTM-Layer/lstm/rnn/dynamic_rnn/input_0"
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/TensorArrayUnstack/Shape"
  op: "Shape"
  input: "LSTM-Layer/lstm/rnn/transpose"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/TensorArrayUnstack/strided_slice/stack"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/TensorArrayUnstack/strided_slice/stack_1"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/TensorArrayUnstack/strided_slice/stack_2"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/TensorArrayUnstack/strided_slice"
  op: "StridedSlice"
  input: "LSTM-Layer/lstm/rnn/TensorArrayUnstack/Shape"
  input: "LSTM-Layer/lstm/rnn/TensorArrayUnstack/strided_slice/stack"
  input: "LSTM-Layer/lstm/rnn/TensorArrayUnstack/strided_slice/stack_1"
  input: "LSTM-Layer/lstm/rnn/TensorArrayUnstack/strided_slice/stack_2"
  device: "/device:GPU:1"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/TensorArrayUnstack/range/start"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/TensorArrayUnstack/range/delta"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/TensorArrayUnstack/range"
  op: "Range"
  input: "LSTM-Layer/lstm/rnn/TensorArrayUnstack/range/start"
  input: "LSTM-Layer/lstm/rnn/TensorArrayUnstack/strided_slice"
  input: "LSTM-Layer/lstm/rnn/TensorArrayUnstack/range/delta"
  device: "/device:GPU:1"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/TensorArrayUnstack/TensorArrayScatter/TensorArrayScatterV3"
  op: "TensorArrayScatterV3"
  input: "LSTM-Layer/lstm/rnn/TensorArray_1"
  input: "LSTM-Layer/lstm/rnn/TensorArrayUnstack/range"
  input: "LSTM-Layer/lstm/rnn/transpose"
  input: "LSTM-Layer/lstm/rnn/TensorArray_1:1"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@LSTM-Layer/lstm/rnn/transpose"
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/Maximum/x"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/Maximum"
  op: "Maximum"
  input: "LSTM-Layer/lstm/rnn/Maximum/x"
  input: "LSTM-Layer/lstm/rnn/strided_slice_1"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/Minimum"
  op: "Minimum"
  input: "LSTM-Layer/lstm/rnn/strided_slice_1"
  input: "LSTM-Layer/lstm/rnn/Maximum"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/while/iteration_counter"
  op: "Const"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/while/Enter"
  op: "Enter"
  input: "LSTM-Layer/lstm/rnn/while/iteration_counter"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "LSTM-Layer/lstm/rnn/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: false
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 32
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/while/Enter_1"
  op: "Enter"
  input: "LSTM-Layer/lstm/rnn/time"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "LSTM-Layer/lstm/rnn/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: false
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 32
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/while/Enter_2"
  op: "Enter"
  input: "LSTM-Layer/lstm/rnn/TensorArray:1"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "LSTM-Layer/lstm/rnn/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: false
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 32
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/while/Enter_3"
  op: "Enter"
  input: "LSTM-Layer/lstm/rnn/LSTMCellZeroState/zeros"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "LSTM-Layer/lstm/rnn/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: false
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 32
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/while/Enter_4"
  op: "Enter"
  input: "LSTM-Layer/lstm/rnn/LSTMCellZeroState/zeros_1"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "LSTM-Layer/lstm/rnn/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: false
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 32
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/while/Merge"
  op: "Merge"
  input: "LSTM-Layer/lstm/rnn/while/Enter"
  input: "LSTM-Layer/lstm/rnn/while/NextIteration"
  device: "/device:GPU:1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/while/Merge_1"
  op: "Merge"
  input: "LSTM-Layer/lstm/rnn/while/Enter_1"
  input: "LSTM-Layer/lstm/rnn/while/NextIteration_1"
  device: "/device:GPU:1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/while/Merge_2"
  op: "Merge"
  input: "LSTM-Layer/lstm/rnn/while/Enter_2"
  input: "LSTM-Layer/lstm/rnn/while/NextIteration_2"
  device: "/device:GPU:1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/while/Merge_3"
  op: "Merge"
  input: "LSTM-Layer/lstm/rnn/while/Enter_3"
  input: "LSTM-Layer/lstm/rnn/while/NextIteration_3"
  device: "/device:GPU:1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/while/Merge_4"
  op: "Merge"
  input: "LSTM-Layer/lstm/rnn/while/Enter_4"
  input: "LSTM-Layer/lstm/rnn/while/NextIteration_4"
  device: "/device:GPU:1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/while/Less"
  op: "Less"
  input: "LSTM-Layer/lstm/rnn/while/Merge"
  input: "LSTM-Layer/lstm/rnn/while/Less/Enter"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/while/Less/Enter"
  op: "Enter"
  input: "LSTM-Layer/lstm/rnn/strided_slice_1"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "LSTM-Layer/lstm/rnn/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: true
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 32
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/while/Less_1"
  op: "Less"
  input: "LSTM-Layer/lstm/rnn/while/Merge_1"
  input: "LSTM-Layer/lstm/rnn/while/Less_1/Enter"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/while/Less_1/Enter"
  op: "Enter"
  input: "LSTM-Layer/lstm/rnn/Minimum"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "LSTM-Layer/lstm/rnn/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: true
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 32
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/while/LogicalAnd"
  op: "LogicalAnd"
  input: "LSTM-Layer/lstm/rnn/while/Less"
  input: "LSTM-Layer/lstm/rnn/while/Less_1"
  device: "/device:GPU:1"
}
node {
  name: "LSTM-Layer/lstm/rnn/while/LoopCond"
  op: "LoopCond"
  input: "LSTM-Layer/lstm/rnn/while/LogicalAnd"
  device: "/device:GPU:1"
}
node {
  name: "LSTM-Layer/lstm/rnn/while/Switch"
  op: "Switch"
  input: "LSTM-Layer/lstm/rnn/while/Merge"
  input: "LSTM-Layer/lstm/rnn/while/LoopCond"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@LSTM-Layer/lstm/rnn/while/Merge"
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/while/Switch_1"
  op: "Switch"
  input: "LSTM-Layer/lstm/rnn/while/Merge_1"
  input: "LSTM-Layer/lstm/rnn/while/LoopCond"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@LSTM-Layer/lstm/rnn/while/Merge_1"
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/while/Switch_2"
  op: "Switch"
  input: "LSTM-Layer/lstm/rnn/while/Merge_2"
  input: "LSTM-Layer/lstm/rnn/while/LoopCond"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@LSTM-Layer/lstm/rnn/while/Merge_2"
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/while/Switch_3"
  op: "Switch"
  input: "LSTM-Layer/lstm/rnn/while/Merge_3"
  input: "LSTM-Layer/lstm/rnn/while/LoopCond"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@LSTM-Layer/lstm/rnn/while/Merge_3"
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/while/Switch_4"
  op: "Switch"
  input: "LSTM-Layer/lstm/rnn/while/Merge_4"
  input: "LSTM-Layer/lstm/rnn/while/LoopCond"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@LSTM-Layer/lstm/rnn/while/Merge_4"
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/while/Identity"
  op: "Identity"
  input: "LSTM-Layer/lstm/rnn/while/Switch:1"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/while/Identity_1"
  op: "Identity"
  input: "LSTM-Layer/lstm/rnn/while/Switch_1:1"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/while/Identity_2"
  op: "Identity"
  input: "LSTM-Layer/lstm/rnn/while/Switch_2:1"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/while/Identity_3"
  op: "Identity"
  input: "LSTM-Layer/lstm/rnn/while/Switch_3:1"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/while/Identity_4"
  op: "Identity"
  input: "LSTM-Layer/lstm/rnn/while/Switch_4:1"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/while/add/y"
  op: "Const"
  input: "^LSTM-Layer/lstm/rnn/while/Identity"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/while/add"
  op: "Add"
  input: "LSTM-Layer/lstm/rnn/while/Identity"
  input: "LSTM-Layer/lstm/rnn/while/add/y"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/while/TensorArrayReadV3"
  op: "TensorArrayReadV3"
  input: "LSTM-Layer/lstm/rnn/while/TensorArrayReadV3/Enter"
  input: "LSTM-Layer/lstm/rnn/while/Identity_1"
  input: "LSTM-Layer/lstm/rnn/while/TensorArrayReadV3/Enter_1"
  device: "/device:GPU:1"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/while/TensorArrayReadV3/Enter"
  op: "Enter"
  input: "LSTM-Layer/lstm/rnn/TensorArray_1"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "LSTM-Layer/lstm/rnn/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: true
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 32
    }
  }
}
node {
  name: "LSTM-Layer/lstm/rnn/while/TensorArrayReadV3/Enter_1"
  op: "Enter"
  input: "LSTM-Layer/lstm/rnn/TensorArrayUnstack/TensorArrayScatter/TensorArrayScatterV3"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "LSTM-Layer/lstm/rnn/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: true
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 32
    }
  }
}
node {
  name: "lstm/rnn/lstm_cell/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lstm/rnn/lstm_cell/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "$\000\000\000\020\000\000\000"
      }
    }
  }
}
node {
  name: "lstm/rnn/lstm_cell/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lstm/rnn/lstm_cell/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.3396831154823303
      }
    }
  }
}
node {
  name: "lstm/rnn/lstm_cell/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lstm/rnn/lstm_cell/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.3396831154823303
      }
    }
  }
}
node {
  name: "lstm/rnn/lstm_cell/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "lstm/rnn/lstm_cell/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lstm/rnn/lstm_cell/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "lstm/rnn/lstm_cell/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "lstm/rnn/lstm_cell/kernel/Initializer/random_uniform/max"
  input: "lstm/rnn/lstm_cell/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lstm/rnn/lstm_cell/kernel"
      }
    }
  }
}
node {
  name: "lstm/rnn/lstm_cell/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "lstm/rnn/lstm_cell/kernel/Initializer/random_uniform/RandomUniform"
  input: "lstm/rnn/lstm_cell/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lstm/rnn/lstm_cell/kernel"
      }
    }
  }
}
node {
  name: "lstm/rnn/lstm_cell/kernel/Initializer/random_uniform"
  op: "Add"
  input: "lstm/rnn/lstm_cell/kernel/Initializer/random_uniform/mul"
  input: "lstm/rnn/lstm_cell/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lstm/rnn/lstm_cell/kernel"
      }
    }
  }
}
node {
  name: "lstm/rnn/lstm_cell/kernel"
  op: "VariableV2"
  device: "/device:GPU:1"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lstm/rnn/lstm_cell/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 36
        }
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "lstm/rnn/lstm_cell/kernel/Assign"
  op: "Assign"
  input: "lstm/rnn/lstm_cell/kernel"
  input: "lstm/rnn/lstm_cell/kernel/Initializer/random_uniform"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lstm/rnn/lstm_cell/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "lstm/rnn/lstm_cell/kernel/read"
  op: "Identity"
  input: "lstm/rnn/lstm_cell/kernel"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "lstm/rnn/lstm_cell/bias/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lstm/rnn/lstm_cell/bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "lstm/rnn/lstm_cell/bias"
  op: "VariableV2"
  device: "/device:GPU:1"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lstm/rnn/lstm_cell/bias"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "lstm/rnn/lstm_cell/bias/Assign"
  op: "Assign"
  input: "lstm/rnn/lstm_cell/bias"
  input: "lstm/rnn/lstm_cell/bias/Initializer/zeros"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lstm/rnn/lstm_cell/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "lstm/rnn/lstm_cell/bias/read"
  op: "Identity"
  input: "lstm/rnn/lstm_cell/bias"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "lstm/rnn/lstm_cell/w_f_diag/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lstm/rnn/lstm_cell/w_f_diag"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 4
      }
    }
  }
}
node {
  name: "lstm/rnn/lstm_cell/w_f_diag/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lstm/rnn/lstm_cell/w_f_diag"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.8660253882408142
      }
    }
  }
}
node {
  name: "lstm/rnn/lstm_cell/w_f_diag/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lstm/rnn/lstm_cell/w_f_diag"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.8660253882408142
      }
    }
  }
}
node {
  name: "lstm/rnn/lstm_cell/w_f_diag/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "lstm/rnn/lstm_cell/w_f_diag/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lstm/rnn/lstm_cell/w_f_diag"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "lstm/rnn/lstm_cell/w_f_diag/Initializer/random_uniform/sub"
  op: "Sub"
  input: "lstm/rnn/lstm_cell/w_f_diag/Initializer/random_uniform/max"
  input: "lstm/rnn/lstm_cell/w_f_diag/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lstm/rnn/lstm_cell/w_f_diag"
      }
    }
  }
}
node {
  name: "lstm/rnn/lstm_cell/w_f_diag/Initializer/random_uniform/mul"
  op: "Mul"
  input: "lstm/rnn/lstm_cell/w_f_diag/Initializer/random_uniform/RandomUniform"
  input: "lstm/rnn/lstm_cell/w_f_diag/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lstm/rnn/lstm_cell/w_f_diag"
      }
    }
  }
}
node {
  name: "lstm/rnn/lstm_cell/w_f_diag/Initializer/random_uniform"
  op: "Add"
  input: "lstm/rnn/lstm_cell/w_f_diag/Initializer/random_uniform/mul"
  input: "lstm/rnn/lstm_cell/w_f_diag/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lstm/rnn/lstm_cell/w_f_diag"
      }
    }
  }
}
node {
  name: "lstm/rnn/lstm_cell/w_f_diag"
  op: "VariableV2"
  device: "/device:GPU:1"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lstm/rnn/lstm_cell/w_f_diag"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 4
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "lstm/rnn/lstm_cell/w_f_diag/Assign"
  op: "Assign"
  input: "lstm/rnn/lstm_cell/w_f_diag"
  input: "lstm/rnn/lstm_cell/w_f_diag/Initializer/random_uniform"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lstm/rnn/lstm_cell/w_f_diag"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "lstm/rnn/lstm_cell/w_f_diag/read"
  op: "Identity"
  input: "lstm/rnn/lstm_cell/w_f_diag"
  device: "/device:GPU:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "lstm/rnn/lstm_cell/w_i_diag/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lstm/rnn/lstm_cell/w_i_diag"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 4
      }
    }
  }
}
node {
  name: "lstm/rnn/lstm_cell/w_i_diag/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lstm/rnn/lstm_cell/w_i_diag"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.8660253882408142
      }
    }
  }
}
node {
  name: "lstm/rnn/lstm_cell/w_i_diag/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lstm/rnn/lstm_cell/w_i_diag"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.8660253882408142
      }
    }
  }
}
node {
  name: "lstm/rnn/lstm_cell/w_i_diag/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "lstm/rnn/lstm_cell/w_i_diag/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lstm/rnn/lstm_cell/w_i_diag"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "lstm/rnn/lstm_cell/w_i_diag/Initializer/random_uniform/sub"
  op: "Sub"
  input: "lstm/rnn/lstm_cell/w_i_diag/Initializer/random_uniform/max"
  input: "lstm/rnn/lstm_cell/w_i_diag/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lstm/rnn/lstm_cell/w_i_diag"
      }
    }
  }
}
node {
  name: "lstm/rnn/lstm_cell/w_i_diag/Initializer/random_uniform/mul"
  op: "Mul"
  input: "lstm/rnn/lstm_cell/w_i_diag/Initializer/random_uniform/RandomUniform"
  input: "lstm/rnn/lstm_cell/w_i_diag/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@lstm/rnn/lstm_cell/w_i_diag"
      }
    }
  }
}
node {
  name: "lstm/rnn/lstm_cell/w_i_diag/Initializer/random_uniform"
  op: "Add"
